; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=348, out_folder=./training, instance_id=76, seed=2100, goal_proportion=0.03

(define (problem blocksworld-76)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 b313 b314 b315 b316 b317 b318 b319 b320 b321 b322 b323 b324 b325 b326 b327 b328 b329 b330 b331 b332 b333 b334 b335 b336 b337 b338 b339 b340 b341 b342 b343 b344 b345 b346 b347 b348 - object)
 (:init 
    (arm-empty)
    (clear b256)
    (on b256 b161)
    (on b161 b159)
    (on b159 b313)
    (on b313 b209)
    (on b209 b56)
    (on b56 b212)
    (on b212 b190)
    (on b190 b345)
    (on b345 b62)
    (on b62 b171)
    (on b171 b259)
    (on b259 b235)
    (on b235 b63)
    (on b63 b257)
    (on b257 b213)
    (on b213 b70)
    (on b70 b347)
    (on-table b347)
    (clear b274)
    (on-table b274)
    (clear b262)
    (on-table b262)
    (clear b317)
    (on-table b317)
    (clear b24)
    (on b24 b300)
    (on b300 b202)
    (on-table b202)
    (clear b107)
    (on b107 b198)
    (on b198 b96)
    (on b96 b278)
    (on b278 b100)
    (on b100 b97)
    (on b97 b165)
    (on b165 b208)
    (on b208 b122)
    (on b122 b225)
    (on-table b225)
    (clear b247)
    (on b247 b346)
    (on b346 b114)
    (on b114 b283)
    (on b283 b234)
    (on b234 b167)
    (on b167 b223)
    (on b223 b33)
    (on b33 b296)
    (on b296 b174)
    (on b174 b299)
    (on b299 b242)
    (on b242 b77)
    (on b77 b55)
    (on b55 b170)
    (on-table b170)
    (clear b88)
    (on b88 b121)
    (on b121 b302)
    (on b302 b65)
    (on b65 b197)
    (on b197 b31)
    (on b31 b169)
    (on b169 b6)
    (on b6 b158)
    (on-table b158)
    (clear b126)
    (on b126 b291)
    (on b291 b333)
    (on b333 b337)
    (on b337 b334)
    (on-table b334)
    (clear b13)
    (on b13 b311)
    (on b311 b84)
    (on b84 b19)
    (on-table b19)
    (clear b98)
    (on b98 b59)
    (on b59 b120)
    (on b120 b29)
    (on b29 b53)
    (on b53 b22)
    (on b22 b23)
    (on b23 b66)
    (on-table b66)
    (clear b154)
    (on-table b154)
    (clear b81)
    (on b81 b314)
    (on b314 b75)
    (on b75 b215)
    (on b215 b342)
    (on b342 b91)
    (on b91 b125)
    (on-table b125)
    (clear b196)
    (on b196 b40)
    (on-table b40)
    (clear b127)
    (on b127 b90)
    (on b90 b141)
    (on b141 b258)
    (on b258 b287)
    (on b287 b89)
    (on b89 b218)
    (on-table b218)
    (clear b308)
    (on b308 b307)
    (on b307 b295)
    (on b295 b348)
    (on-table b348)
    (clear b293)
    (on-table b293)
    (clear b119)
    (on b119 b39)
    (on b39 b310)
    (on b310 b194)
    (on b194 b163)
    (on-table b163)
    (clear b8)
    (on b8 b253)
    (on b253 b290)
    (on b290 b61)
    (on b61 b180)
    (on b180 b136)
    (on b136 b18)
    (on b18 b45)
    (on-table b45)
    (clear b150)
    (on b150 b164)
    (on b164 b52)
    (on-table b52)
    (clear b172)
    (on b172 b160)
    (on b160 b236)
    (on b236 b335)
    (on b335 b9)
    (on b9 b288)
    (on b288 b82)
    (on b82 b277)
    (on b277 b271)
    (on-table b271)
    (clear b282)
    (on-table b282)
    (clear b86)
    (on-table b86)
    (clear b60)
    (on b60 b110)
    (on b110 b240)
    (on b240 b338)
    (on-table b338)
    (clear b331)
    (on b331 b252)
    (on b252 b216)
    (on b216 b69)
    (on-table b69)
    (clear b187)
    (on b187 b149)
    (on b149 b219)
    (on b219 b200)
    (on b200 b228)
    (on b228 b85)
    (on b85 b178)
    (on b178 b250)
    (on-table b250)
    (clear b157)
    (on b157 b139)
    (on-table b139)
    (clear b116)
    (on b116 b336)
    (on b336 b83)
    (on-table b83)
    (clear b76)
    (on-table b76)
    (clear b233)
    (on-table b233)
    (clear b144)
    (on b144 b118)
    (on-table b118)
    (clear b316)
    (on b316 b289)
    (on b289 b263)
    (on b263 b148)
    (on b148 b324)
    (on b324 b275)
    (on b275 b1)
    (on b1 b109)
    (on b109 b129)
    (on b129 b292)
    (on-table b292)
    (clear b113)
    (on b113 b134)
    (on b134 b286)
    (on b286 b246)
    (on b246 b304)
    (on b304 b340)
    (on-table b340)
    (clear b273)
    (on b273 b175)
    (on-table b175)
    (clear b231)
    (on b231 b44)
    (on b44 b74)
    (on b74 b326)
    (on b326 b323)
    (on b323 b341)
    (on b341 b204)
    (on b204 b87)
    (on-table b87)
    (clear b54)
    (on b54 b173)
    (on b173 b7)
    (on-table b7)
    (clear b297)
    (on-table b297)
    (clear b50)
    (on b50 b226)
    (on b226 b189)
    (on b189 b135)
    (on b135 b72)
    (on b72 b279)
    (on b279 b37)
    (on b37 b42)
    (on b42 b106)
    (on b106 b264)
    (on-table b264)
    (clear b138)
    (on-table b138)
    (clear b329)
    (on b329 b230)
    (on b230 b280)
    (on b280 b183)
    (on b183 b104)
    (on-table b104)
    (clear b309)
    (on b309 b30)
    (on b30 b17)
    (on b17 b319)
    (on b319 b155)
    (on-table b155)
    (clear b67)
    (on b67 b36)
    (on b36 b26)
    (on b26 b48)
    (on b48 b10)
    (on-table b10)
    (clear b217)
    (on-table b217)
    (clear b267)
    (on-table b267)
    (clear b269)
    (on-table b269)
    (clear b179)
    (on b179 b73)
    (on-table b73)
    (clear b105)
    (on b105 b140)
    (on b140 b130)
    (on b130 b266)
    (on b266 b184)
    (on b184 b143)
    (on b143 b315)
    (on b315 b306)
    (on b306 b79)
    (on b79 b220)
    (on-table b220)
    (clear b124)
    (on b124 b243)
    (on b243 b232)
    (on b232 b238)
    (on b238 b210)
    (on-table b210)
    (clear b312)
    (on-table b312)
    (clear b260)
    (on b260 b111)
    (on-table b111)
    (clear b322)
    (on-table b322)
    (clear b5)
    (on-table b5)
    (clear b21)
    (on b21 b68)
    (on b68 b301)
    (on b301 b227)
    (on b227 b270)
    (on b270 b20)
    (on-table b20)
    (clear b43)
    (on b43 b328)
    (on-table b328)
    (clear b332)
    (on-table b332)
    (clear b166)
    (on b166 b147)
    (on b147 b101)
    (on b101 b117)
    (on b117 b4)
    (on-table b4)
    (clear b12)
    (on b12 b344)
    (on b344 b339)
    (on b339 b80)
    (on b80 b49)
    (on b49 b115)
    (on-table b115)
    (clear b182)
    (on b182 b27)
    (on b27 b268)
    (on b268 b133)
    (on b133 b16)
    (on b16 b58)
    (on b58 b343)
    (on b343 b3)
    (on b3 b156)
    (on b156 b294)
    (on b294 b123)
    (on b123 b168)
    (on b168 b93)
    (on-table b93)
    (clear b272)
    (on b272 b15)
    (on-table b15)
    (clear b201)
    (on b201 b94)
    (on b94 b320)
    (on-table b320)
    (clear b207)
    (on b207 b2)
    (on-table b2)
    (clear b41)
    (on-table b41)
    (clear b229)
    (on b229 b142)
    (on b142 b25)
    (on b25 b327)
    (on b327 b203)
    (on b203 b205)
    (on b205 b108)
    (on b108 b128)
    (on b128 b224)
    (on b224 b145)
    (on-table b145)
    (clear b303)
    (on b303 b92)
    (on-table b92)
    (clear b103)
    (on-table b103)
    (clear b276)
    (on b276 b32)
    (on b32 b64)
    (on-table b64)
    (clear b132)
    (on b132 b11)
    (on b11 b112)
    (on b112 b305)
    (on b305 b330)
    (on b330 b318)
    (on b318 b281)
    (on-table b281)
    (clear b71)
    (on b71 b192)
    (on b192 b186)
    (on-table b186)
    (clear b193)
    (on b193 b255)
    (on b255 b181)
    (on b181 b222)
    (on-table b222)
    (clear b261)
    (on b261 b95)
    (on b95 b265)
    (on-table b265)
    (clear b102)
    (on-table b102)
    (clear b245)
    (on b245 b34)
    (on b34 b249)
    (on b249 b131)
    (on b131 b177)
    (on b177 b248)
    (on b248 b78)
    (on b78 b239)
    (on b239 b298)
    (on b298 b146)
    (on b146 b321)
    (on b321 b244)
    (on b244 b251)
    (on b251 b221)
    (on b221 b284)
    (on b284 b152)
    (on-table b152)
    (clear b137)
    (on b137 b254)
    (on b254 b176)
    (on b176 b38)
    (on b38 b185)
    (on b185 b162)
    (on b162 b325)
    (on b325 b214)
    (on b214 b195)
    (on b195 b14)
    (on-table b14)
    (clear b188)
    (on b188 b51)
    (on b51 b153)
    (on b153 b206)
    (on b206 b199)
    (on b199 b57)
    (on b57 b99)
    (on b99 b35)
    (on b35 b28)
    (on-table b28)
    (clear b191)
    (on b191 b211)
    (on b211 b285)
    (on b285 b46)
    (on b46 b237)
    (on-table b237)
    (clear b47)
    (on b47 b241)
    (on b241 b151)
    (on-table b151))
 (:goal  (and 
    (clear b9)
    (on-table b9)
    (clear b6)
    (on b6 b1)
    (on-table b1)
    (clear b7)
    (on-table b7)
    (clear b2)
    (on b2 b4)
    (on b4 b5)
    (on b5 b10)
    (on b10 b8)
    (on b8 b3)
    (on-table b3))))

; plan
1. (unstack b166 b147)
   deleted: (on b166 b147) (clear b166) (arm-empty)
   added: (holding b166) (clear b147)
   goals met: 1 of 14
2. (putdown b166)
   deleted: (holding b166)
   added: (clear b166) (arm-empty) (on-table b166)
   goals met: 1 of 14
3. (unstack b147 b101)
   deleted: (on b147 b101) (clear b147) (arm-empty)
   added: (holding b147) (clear b101)
   goals met: 1 of 14
4. (putdown b147)
   deleted: (holding b147)
   added: (clear b147) (arm-empty) (on-table b147)
   goals met: 1 of 14
5. (unstack b101 b117)
   deleted: (on b101 b117) (clear b101) (arm-empty)
   added: (holding b101) (clear b117)
   goals met: 1 of 14
6. (putdown b101)
   deleted: (holding b101)
   added: (clear b101) (arm-empty) (on-table b101)
   goals met: 1 of 14
7. (unstack b117 b4)
   deleted: (on b117 b4) (clear b117) (arm-empty)
   added: (holding b117) (clear b4)
   goals met: 1 of 14
8. (putdown b117)
   deleted: (holding b117)
   added: (clear b117) (arm-empty) (on-table b117)
   goals met: 1 of 14
9. (unstack b172 b160)
   deleted: (on b172 b160) (clear b172) (arm-empty)
   added: (holding b172) (clear b160)
   goals met: 1 of 14
10. (putdown b172)
   deleted: (holding b172)
   added: (clear b172) (arm-empty) (on-table b172)
   goals met: 1 of 14
11. (unstack b160 b236)
   deleted: (on b160 b236) (clear b160) (arm-empty)
   added: (holding b160) (clear b236)
   goals met: 1 of 14
12. (putdown b160)
   deleted: (holding b160)
   added: (clear b160) (arm-empty) (on-table b160)
   goals met: 1 of 14
13. (unstack b182 b27)
   deleted: (on b182 b27) (clear b182) (arm-empty)
   added: (holding b182) (clear b27)
   goals met: 1 of 14
14. (putdown b182)
   deleted: (holding b182)
   added: (clear b182) (arm-empty) (on-table b182)
   goals met: 1 of 14
15. (unstack b207 b2)
   deleted: (on b207 b2) (clear b207) (arm-empty)
   added: (holding b207) (clear b2)
   goals met: 2 of 14
16. (putdown b207)
   deleted: (holding b207)
   added: (clear b207) (arm-empty) (on-table b207)
   goals met: 2 of 14
17. (unstack b236 b335)
   deleted: (on b236 b335) (clear b236) (arm-empty)
   added: (holding b236) (clear b335)
   goals met: 2 of 14
18. (putdown b236)
   deleted: (holding b236)
   added: (clear b236) (arm-empty) (on-table b236)
   goals met: 2 of 14
19. (unstack b27 b268)
   deleted: (on b27 b268) (clear b27) (arm-empty)
   added: (holding b27) (clear b268)
   goals met: 2 of 14
20. (putdown b27)
   deleted: (holding b27)
   added: (clear b27) (arm-empty) (on-table b27)
   goals met: 2 of 14
21. (unstack b268 b133)
   deleted: (on b268 b133) (clear b268) (arm-empty)
   added: (holding b268) (clear b133)
   goals met: 2 of 14
22. (putdown b268)
   deleted: (holding b268)
   added: (clear b268) (arm-empty) (on-table b268)
   goals met: 2 of 14
23. (unstack b133 b16)
   deleted: (on b133 b16) (clear b133) (arm-empty)
   added: (holding b133) (clear b16)
   goals met: 2 of 14
24. (putdown b133)
   deleted: (holding b133)
   added: (clear b133) (arm-empty) (on-table b133)
   goals met: 2 of 14
25. (unstack b16 b58)
   deleted: (on b16 b58) (clear b16) (arm-empty)
   added: (holding b16) (clear b58)
   goals met: 2 of 14
26. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 2 of 14
27. (unstack b316 b289)
   deleted: (on b316 b289) (clear b316) (arm-empty)
   added: (holding b316) (clear b289)
   goals met: 2 of 14
28. (putdown b316)
   deleted: (holding b316)
   added: (clear b316) (arm-empty) (on-table b316)
   goals met: 2 of 14
29. (unstack b289 b263)
   deleted: (on b289 b263) (clear b289) (arm-empty)
   added: (holding b289) (clear b263)
   goals met: 2 of 14
30. (putdown b289)
   deleted: (holding b289)
   added: (clear b289) (arm-empty) (on-table b289)
   goals met: 2 of 14
31. (unstack b263 b148)
   deleted: (on b263 b148) (clear b263) (arm-empty)
   added: (holding b263) (clear b148)
   goals met: 2 of 14
32. (putdown b263)
   deleted: (holding b263)
   added: (clear b263) (arm-empty) (on-table b263)
   goals met: 2 of 14
33. (unstack b148 b324)
   deleted: (on b148 b324) (clear b148) (arm-empty)
   added: (holding b148) (clear b324)
   goals met: 2 of 14
34. (putdown b148)
   deleted: (holding b148)
   added: (clear b148) (arm-empty) (on-table b148)
   goals met: 2 of 14
35. (unstack b324 b275)
   deleted: (on b324 b275) (clear b324) (arm-empty)
   added: (holding b324) (clear b275)
   goals met: 2 of 14
36. (putdown b324)
   deleted: (holding b324)
   added: (clear b324) (arm-empty) (on-table b324)
   goals met: 2 of 14
37. (unstack b275 b1)
   deleted: (on b275 b1) (clear b275) (arm-empty)
   added: (holding b275) (clear b1)
   goals met: 2 of 14
38. (putdown b275)
   deleted: (holding b275)
   added: (clear b275) (arm-empty) (on-table b275)
   goals met: 2 of 14
39. (unstack b1 b109)
   deleted: (on b1 b109) (clear b1) (arm-empty)
   added: (holding b1) (clear b109)
   goals met: 2 of 14
40. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 3 of 14
41. (unstack b335 b9)
   deleted: (on b335 b9) (clear b335) (arm-empty)
   added: (holding b335) (clear b9)
   goals met: 4 of 14
42. (putdown b335)
   deleted: (holding b335)
   added: (clear b335) (arm-empty) (on-table b335)
   goals met: 4 of 14
43. (unstack b9 b288)
   deleted: (on b9 b288) (clear b9) (arm-empty)
   added: (holding b9) (clear b288)
   goals met: 3 of 14
44. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 5 of 14
45. (unstack b54 b173)
   deleted: (on b54 b173) (clear b54) (arm-empty)
   added: (holding b54) (clear b173)
   goals met: 5 of 14
46. (putdown b54)
   deleted: (holding b54)
   added: (clear b54) (arm-empty) (on-table b54)
   goals met: 5 of 14
47. (unstack b173 b7)
   deleted: (on b173 b7) (clear b173) (arm-empty)
   added: (holding b173) (clear b7)
   goals met: 6 of 14
48. (putdown b173)
   deleted: (holding b173)
   added: (clear b173) (arm-empty) (on-table b173)
   goals met: 6 of 14
49. (unstack b58 b343)
   deleted: (on b58 b343) (clear b58) (arm-empty)
   added: (holding b58) (clear b343)
   goals met: 6 of 14
50. (putdown b58)
   deleted: (holding b58)
   added: (clear b58) (arm-empty) (on-table b58)
   goals met: 6 of 14
51. (unstack b343 b3)
   deleted: (on b343 b3) (clear b343) (arm-empty)
   added: (holding b343) (clear b3)
   goals met: 6 of 14
52. (putdown b343)
   deleted: (holding b343)
   added: (clear b343) (arm-empty) (on-table b343)
   goals met: 6 of 14
53. (unstack b3 b156)
   deleted: (on b3 b156) (clear b3) (arm-empty)
   added: (holding b3) (clear b156)
   goals met: 6 of 14
54. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 7 of 14
55. (unstack b67 b36)
   deleted: (on b67 b36) (clear b67) (arm-empty)
   added: (holding b67) (clear b36)
   goals met: 7 of 14
56. (putdown b67)
   deleted: (holding b67)
   added: (clear b67) (arm-empty) (on-table b67)
   goals met: 7 of 14
57. (unstack b36 b26)
   deleted: (on b36 b26) (clear b36) (arm-empty)
   added: (holding b36) (clear b26)
   goals met: 7 of 14
58. (putdown b36)
   deleted: (holding b36)
   added: (clear b36) (arm-empty) (on-table b36)
   goals met: 7 of 14
59. (unstack b26 b48)
   deleted: (on b26 b48) (clear b26) (arm-empty)
   added: (holding b26) (clear b48)
   goals met: 7 of 14
60. (putdown b26)
   deleted: (holding b26)
   added: (clear b26) (arm-empty) (on-table b26)
   goals met: 7 of 14
61. (unstack b48 b10)
   deleted: (on b48 b10) (clear b48) (arm-empty)
   added: (holding b48) (clear b10)
   goals met: 7 of 14
62. (putdown b48)
   deleted: (holding b48)
   added: (clear b48) (arm-empty) (on-table b48)
   goals met: 7 of 14
63. (unstack b88 b121)
   deleted: (on b88 b121) (clear b88) (arm-empty)
   added: (holding b88) (clear b121)
   goals met: 7 of 14
64. (putdown b88)
   deleted: (holding b88)
   added: (clear b88) (arm-empty) (on-table b88)
   goals met: 7 of 14
65. (unstack b121 b302)
   deleted: (on b121 b302) (clear b121) (arm-empty)
   added: (holding b121) (clear b302)
   goals met: 7 of 14
66. (putdown b121)
   deleted: (holding b121)
   added: (clear b121) (arm-empty) (on-table b121)
   goals met: 7 of 14
67. (unstack b302 b65)
   deleted: (on b302 b65) (clear b302) (arm-empty)
   added: (holding b302) (clear b65)
   goals met: 7 of 14
68. (putdown b302)
   deleted: (holding b302)
   added: (clear b302) (arm-empty) (on-table b302)
   goals met: 7 of 14
69. (unstack b65 b197)
   deleted: (on b65 b197) (clear b65) (arm-empty)
   added: (holding b65) (clear b197)
   goals met: 7 of 14
70. (putdown b65)
   deleted: (holding b65)
   added: (clear b65) (arm-empty) (on-table b65)
   goals met: 7 of 14
71. (unstack b197 b31)
   deleted: (on b197 b31) (clear b197) (arm-empty)
   added: (holding b197) (clear b31)
   goals met: 7 of 14
72. (putdown b197)
   deleted: (holding b197)
   added: (clear b197) (arm-empty) (on-table b197)
   goals met: 7 of 14
73. (unstack b31 b169)
   deleted: (on b31 b169) (clear b31) (arm-empty)
   added: (holding b31) (clear b169)
   goals met: 7 of 14
74. (putdown b31)
   deleted: (holding b31)
   added: (clear b31) (arm-empty) (on-table b31)
   goals met: 7 of 14
75. (unstack b169 b6)
   deleted: (on b169 b6) (clear b169) (arm-empty)
   added: (holding b169) (clear b6)
   goals met: 8 of 14
76. (putdown b169)
   deleted: (holding b169)
   added: (clear b169) (arm-empty) (on-table b169)
   goals met: 8 of 14
77. (unstack b8 b253)
   deleted: (on b8 b253) (clear b8) (arm-empty)
   added: (holding b8) (clear b253)
   goals met: 8 of 14
78. (stack b8 b3)
   deleted: (clear b3) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b3)
   goals met: 9 of 14
79. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 9 of 14
80. (stack b10 b8)
   deleted: (clear b8) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b8)
   goals met: 10 of 14
81. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 10 of 14
82. (stack b5 b10)
   deleted: (clear b10) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b10)
   goals met: 11 of 14
83. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 11 of 14
84. (stack b4 b5)
   deleted: (clear b5) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b5)
   goals met: 12 of 14
85. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 11 of 14
86. (stack b2 b4)
   deleted: (clear b4) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b4)
   goals met: 13 of 14
87. (unstack b6 b158)
   deleted: (on b6 b158) (clear b6) (arm-empty)
   added: (holding b6) (clear b158)
   goals met: 12 of 14
88. (stack b6 b1)
   deleted: (clear b1) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b1)
   goals met: 14 of 14
